Repository: linuxscout/hunspell
Catalog: po/*.po
Languages: ar_dz

source: Line %d: %s -> %s
ar_dz: سطر %d: %s -> %s

source: FORBIDDEN!
ar_dz: ممنوع!

source: %s File: %s
ar_dz: %s ملف: %s

source: [SP] <number> R)epl A)ccept I)nsert L)ookup U)ncap Q)uit e(X)it or ? for help
ar_dz: [مسافة] <رقم> ا)ستبدال ق)بول إ)دراج ب)حث ت)خفيض إن)هاء (خ)روج أو ؟ للمساعدة

source: Whenever a word is found that is not in the dictionary
ar_dz: عندما يعثر على كلمة ليست في القاموس

source: it is printed on the first line of the screen. If the dictionary
ar_dz: تطبع في أول سطر من الشاشة. وإذا كان القاموس

source: contains any similar words, they are listed with a number
ar_dz: يحوي أي كلمات متشابهة، فإنها توضع في قائمة مع رقم

source: next to each one. You have the option of replacing the word
ar_dz: مصاحب لكل منها. ولك الخيار في استبدال الكلمة

source: completely, or choosing one of the suggested words.
ar_dz: كليةً أو اختيار أحد الكلمات المقترحة.

source: Commands are:
ar_dz: الأوامر هي:

source: R Replace the misspelled word completely.
ar_dz: ا ستبدال الكلمة الخاطئة كلية.

source: Space Accept the word this time only.
ar_dz: مسافة قبول الكلمة هذه المرة فقط.

source: A Accept the word for the rest of this session.
ar_dz: ق قبول الكلمة حتى نهاية هذه الجلسة.

source: I Accept the word, and put it in your private dictionary.
ar_dz: إ قبول الكلمة ووضعها في قاموسك الخاص.

source: U Accept and add lowercase version to private dictionary.
ar_dz: ت قبول وإضافة نسخة الأحرف الصغيرة للقاموس الخاص.

source: O Ask two words. First word will accepted with 2nd's affixes too.
ar_dz: م مطالبة بكلمتين. ستقبل الكلمة الأولى مع ملحقات الثانية أيضاً.

source: 0-n Replace with one of the suggested words.
ar_dz: 0-n استبدل بإحدى الكلمات المقترحة.

source: L Look up words in system dictionary.
ar_dz: ب البحث عن الكلمات في قاموس النظام.

source: X Write the rest of this file, ignoring misspellings, and start next file.
ar_dz: ك كتابة بقية الملف مع تجاهل الأخطاء الإملائية والبدء من الملف التالي.

source: Q Quit immediately. Asks for confirmation. Leaves file unchanged.
ar_dz: إ الإنهاء حالا مع رسالة التأكيد وترك الملف بدون تغيير.

source: ^L Redraw screen
ar_dz: ^L إعادة رسم الشاشة

source: ^Z Suspend program. Restart with fg command.
ar_dz: ^Z تعليق البرنامج. إعادة التشغيل عن طريق أمر fg.

source: ? Show this help screen.
ar_dz: ? عرض شاشة المساعدة الحالية.

source: -- Type space to continue --
ar_dz: -- اضغط زر المسافة للاستمرار --

source: Replace with:
ar_dz: استبدال ب:

source: Cannot update personal dictionary.
ar_dz: لا يمكن تحديث القاموس الشخصي.

source: New root word:
ar_dz: جذر كلمة جديد

source: Pattern word:
ar_dz: الكلمة النمط:

source: Pattern word must be in the dictionary. Press any key!
ar_dz: يجب أن تكون الكلمة النمط موجودة في القاموس. الرجاء الضغط على أي مفتاح!

source: Are you sure you want to throw away your changes?
ar_dz: هل تريد بالتأكيد الاستغناء عن تغييراتك؟

source: Can't create tempfile %s.
ar_dz: لا يمكن إنشاء ملف مؤقت %s.

source: Usage: hunspell [OPTION]... [FILE]...
ar_dz: الاستخدام: hunspell [OPTION]... [FILE]...

source: Check spelling of each FILE. Without FILE, check standard input.
ar_dz: فحص الأخطاء الإملائية لكل من الملفات. من دون خيار FILE فحص الدخل القياسي.

source: -1 check only first field in lines (delimiter = tabulator)
ar_dz: -1 افحص فقط الحقل الأول في الأسطر (delimiter = tabulator)

source: -a Ispell's pipe interface
ar_dz: -a واجهة برنامج آيسبل

source: -d dict use dict dictionary
ar_dz: -d dict استخدام قاموس dic

source: -G print only correct words or lines
ar_dz: -G طباعة الكلمات أو الأسطر الصحيحة فقط

source: -h, --help display this help and exit
ar_dz: -h, --help عرض هذه التعليمات ومن ثم الخروج

source: -H HTML input file format
ar_dz: -H صيغة ملف الإدخال HTML

source: -l print mispelled words
ar_dz: -l طباعة الكلمات الخاطئة

source: -L print lines with mispelled words
ar_dz: -L طباعة الأسطر مع الكلمات الخاطئة

source: -n nroff/troff input file format
ar_dz: -n نسق ملف إدخال nroff/troff

source: -p dict set dict custom dictionary
ar_dz: -p dict ضبط قاموس dic المخصص

source: -t TeX/LaTeX input file format
ar_dz: -t نسق ملف إدخال TeX/LaTeX

source: -u show typical misspellings
ar_dz: -u عرض الأخطاء الإملائية المعتادة

source: -u2 print typical misspellings in sed format
ar_dz: -u2 طباعة الأخطاء الإملائية المعتادة في صيغة sed

source: -U automatic correction of typical misspellings to stdout
ar_dz: -U تصحيح تلقائي للأخطاء الإملائية المعتادة في جهاز الإخراج

source: -v, --version print version number
ar_dz: -v, --version طباعة رقم الإصدار

source: -vv print Ispell compatible version number
ar_dz: -vv طباعة رقم إصدار آيسبل المتوافق

source: -w print mispelled words (= lines) from one word/line input.
ar_dz: -w طباعة الكلمات الخاطئة (= الأسطر) من كلمة/سطر إدخال واحد.

source: Example: hunspell -d english file.txt # interactive spelling
ar_dz: مثال: hunspell -d english file.txt # تدقيق إملائي تفاعلي

source: hunspell -l file.txt # print misspelled words
ar_dz: hunspell -l file.txt # طباعة الكلمات الخاطئة

source: hunspell -u file.txt # print typical (=serious) misspellings
ar_dz: hunspell -u file.txt # طباعة الأخطاء الإملائية المعتادة (=الظاهرة)

source: E-mail bug reports to: szoszablya-user@lists.mokk.bme.hu
ar_dz: أرسل تقارير الخطأ لـ: szoszablya-user@lists.mokk.bme.hu

source: Copyright (C) 2002-2005 Nemeth Laszlo. License: GNU LGPL.
ar_dz: حقوق النسخ (C) 2002-2005 Nemeth Laszlo. تحت ترخيث: GNU LGPL.

source: Based on OpenOffice.org's Myspell library.
ar_dz: معتمدا على مكتبة OpenOffice.org's Myspell .

source: This is free software; see the source for copying conditions. There is NO
ar_dz: هذا برنامج حر، راجع المصدر لشروط الاستخدام. لا يوجد

source: warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE,
ar_dz: ضمان، سواء متعلق بصلاحية عرضه في السوق أو استخدامه لأي غرض كان،

source: to the extent permitted by law.
ar_dz: للحد المسموح به في القانون.

source: Can't open %s.
ar_dz: لا يمكن فتح %s.

source: Can't open affix or dictionary files.
ar_dz: لا يمكن فتح ملفات القاموس أو الملحقات.

source: Hunspell has been compiled without Ncurses user interface.
ar_dz: تم تجميع البرنامج بدون واجهة استخدام Ncurses.
